---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.Camera.HorizontalExtent
source: html/0fe649b8-ea43-2e8f-65e2-5b7bb12a2ff2.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.HorizontalExtent Property

Horizontal extent of the camera's view, measured at target distance.

## Syntax (C#)
```csharp
public double HorizontalExtent { get; set; }
```